In [25]:
pwd

'/Users/Vikas'

In [26]:
# Refer the URL https://pandas.pydata.org/pandas-docs/stable/10min.html
# to get more details

In [2]:
# Because all 3 libraries are mostly used for analytcis they are all imported together 
# and named as pd, nm and plt respectively though we can call teh instances anything
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
# Create a pandas series i.e a single list of values
pd_srs = pd.Series([1,2,3,np.nan,5,6])
pd_srs

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
dtype: float64

In [23]:
#Create a dataframe using list of dictonaries
#If you are comforatble using Row based approach
persons = [{'Name': 'Person 1', 'Country':'USA', 'Age': 10, 'Gender':'M'},
         {'Name': 'Person 2', 'Country':'CHINA', 'Age': 20, 'Gender':'F'},
         {'Name': 'Person 3', 'Country':'INDIA', 'Age': 30, 'Gender':np.NaN}]
pd.DataFrame.from_dict(persons)

   Age Country Gender      Name
0   10     USA      M  Person 1
1   20   CHINA      F  Person 2
2   30   INDIA    NaN  Person 3

In [55]:
#Create a dataframe using dictonaries of list
#If you are comforatble using column approach
persons = {'Name': ['Person 1', 'Person 2', 'Person 3'],
         'Country': ['USA', 'CHINA', 'INDIA'],
         'Age': [10, 20, 30],
         'Gender': ['M', 'F', np.NaN]}
persons_df = pd.DataFrame(persons)
persons_df

   Age Country Gender      Name
0   10     USA      M  Person 1
1   20   CHINA      F  Person 2
2   30   INDIA    NaN  Person 3

In [56]:
# How to show or list all teh columns that are present
persons_df.columns

Index(['Age', 'Country', 'Gender', 'Name'], dtype='object')

In [50]:
# Reading an excel worksheet
df= pd.read_excel("/Users/Vikas/Desktop/sample_data.xlsx", sheetname="Sheet1")

In [51]:
#Check if the file is loaded correctly, you can use head or tail function
df.head() # head by default reads the 1st 5 rows but we can parameters too
df.head(3) # will read 1st 3 rows
df.tail(3) # will display last 3 rows

    Name  Age Gender  Zipcode Married  Savings
7   Row8   80      F    88776       N    70000
8   Row9   90      F    78654       N    60000
9  Row10  100      M    55545       N    55000

In [52]:
# Stats for numeric data
stats = df.describe()
print(stats)

              Age       Zipcode        Savings
count   10.000000     10.000000      10.000000
mean    55.000000  46306.900000   54200.000000
std     30.276504  32926.531968   39196.938656
min     10.000000   8820.000000    2000.000000
25%     32.500000  19049.000000   26250.000000
50%     55.000000  39594.500000   57500.000000
75%     77.500000  72876.750000   67500.000000
max    100.000000  98765.000000  125000.000000

In [182]:
df["Gender"].unique() # Unique Genders
df["Gender"].value_counts() # Count , Group by Gender
df["Savings"].sum() # total savings

542000

In [186]:
#Lets change the column Names
df.rename(columns={"Savings": "Assets"}) # Change one column
df.rename(columns={"Savings": "Assets", "Name":"First_Name"}) # Or Multiple columns

  First_Name  Age Gender  Zipcode Married  Assets  New Age
0       Row1   10      M     8820       N    5000       11
1       Row2   20      F    33511       N    2000       21
2       Row3   30      M    17654       N   20000       31
3       Row4   40      F    45678       Y   45000       41
4       Row5   50      M    98765       Y   60000       51
5       Row6   60      F    23234       Y  100000       61
6       Row7   70      M    12432       Y  125000       71
7       Row8   80      F    88776       N   70000       81
8       Row9   90      F    78654       N   60000       91
9      Row10  100      M    55545       N   55000      101

In [189]:
# Add a new column to existing dataframe
new_age = df["Age"]+1
df["New Age"] = new_age
print(df)

# Delete the extra column we addeds
del df['New Age']
print(df)

    Name  Age Gender  Zipcode Married  Savings  New Age
0   Row1   10      M     8820       N     5000       11
1   Row2   20      F    33511       N     2000       21
2   Row3   30      M    17654       N    20000       31
3   Row4   40      F    45678       Y    45000       41
4   Row5   50      M    98765       Y    60000       51
5   Row6   60      F    23234       Y   100000       61
6   Row7   70      M    12432       Y   125000       71
7   Row8   80      F    88776       N    70000       81
8   Row9   90      F    78654       N    60000       91
9  Row10  100      M    55545       N    55000      101
    Name  Age Gender  Zipcode Married  Savings
0   Row1   10      M     8820       N     5000
1   Row2   20      F    33511       N     2000
2   Row3   30      M    17654       N    20000
3   Row4   40      F    45678       Y    45000
4   Row5   50      M    98765       Y    60000
5   Row6   60      F    23234       Y   100000
6   Row7   70      M    12432       Y   125000
7   Row8   80      F    88776       N    70000
8   Row9   90      F    78654       N    60000
9  Row10  100      M    55545       N    55000

In [176]:
df= pd.read_excel("/Users/Vikas/Desktop/sample_data.xlsx", sheetname="Sheet1")
df[["Age", "Savings"]] # What if we want to display only two columns "Age" & "Savings"
df[["Age", "Savings"]].head(3) # What if we want to display only two columns "Age" & "Savings" but only 1st 3 rows

   Age  Savings
0   10     5000
1   20     2000
2   30    20000

In [53]:
#iloc is used as dataframe.iloc[startrow:endrow,startcol:endcol]
df.iloc[:,0:2].head(3)  # Remember that Python does not slice inclusive of the ending index. 
                        # so this one display only col 0 and col 1 not col 0,1 & 2

df.iloc[-1:,-1:]        # displays the last row and last col
df.iloc[-2:-1,-2:-1]    # displays the 2nd to last row and 2nd to last col

  Married
8       N

In [56]:
#loc is used as dataframe.loc[[startrow,endrow] OR startkeyvalue:endkeyvalue,[startcol,endcol]OR[startcol:endcol]]
#if no column name specificed uses teh index row which is numeric
df.loc[7] # loc(ate) row with the id value 7 , output of this is a series object
df.loc[5:7] # loc(ate) row with the id values from 5 to 7  with all columns, output of this is a data frame object
df.loc[5:7,'Name':'Gender'] # loc(ate) row with the id values from 5 to 7  and cols from Name to Gender (including Age as well)

df.loc[[5,7],['Name','Gender']] # loc(ate) row with the id values from 5 and 7 with 2 columns Name & Gender
df.loc[:,'Name':'Gender'] # display all rows and all columns starting from Name till (incluiding) Gender
df.loc[:,:] # display all rows and all columns no filter criteria
df.loc[:,:].tail(2) # display last 2 rows and all columns no filter criteria

    Name  Age Gender  Zipcode Married  Savings
8   Row9   90      F    78654       N    60000
9  Row10  100      M    55545       N    55000

In [83]:
#What if we want to use loc by replacing the index column with one of teh actual columns
#first step is to replace the index column which can be acheived as 
#for this specific example we will recreate the dataframe as it owerwrites the id column everytime
df= pd.read_excel("/Users/Vikas/Desktop/sample_data.xlsx", sheetname="Sheet1")
df.set_index("Gender", inplace=True) 
df.head(3) # Duplicate values are allowed look at the output
#Now we can search based on the Gender value as
df.loc['M']

         Name  Age  Zipcode Married  Savings
Gender
M        Row1   10     8820       N     5000
M        Row3   30    17654       N    20000
M        Row5   50    98765       Y    60000
M        Row7   70    12432       Y   125000
M       Row10  100    55545       N    55000

In [107]:
#What if we want to use loc for specific columns such as show only Married individuals
df= pd.read_excel("/Users/Vikas/Desktop/sample_data.xlsx", sheetname="Sheet1")
df.loc[df['Married'] == 'Y',:]# show all columns for all rows that have Married as Y
df.loc[df['Married'] == 'Y', 'Name']# show Name (only 1 column) for all rows that have Married as Y
df.loc[df['Married'] == 'Y', ['Name','Age']]# show Name & Age (only 2 column) for all rows that have Married as Y
df.loc[df['Married'] == 'Y', 'Name':'Zipcode']# show Name & Age (only 2 column) for all rows that have Married as Y

df.loc[df['Age'] > 50,:]# show all columns for all rows that have Age more then 50

df.loc[(df['Age'] > 50) & (df['Age'] < 80) ,:]# show all columns for rows having Age more then 50 and less then 80
df.loc[(df['Age'] > 50) | (df['Age'] < 80) ,:]# show all columns for rows having Age more then 50 or less then 80
                                              # Above statement actually show all records
df.loc[df['Name'].isin(['Row1','Row2']),:]# show all columns for rows that have names in Row1 & Row2
df.loc[(df['Name'].isin(['Row1','Row2'])) & (df['Age'] == 20),:]# show all columns for rows that have names in Row1 & Row2

   Name  Age Gender  Zipcode Married  Savings
1  Row2   20      F    33511       N     2000

In [111]:
#How do we update a specific cell
# two options
#df.at[index, 'col_name'] = x #this is faster
#OR
#df.loc[index, 'COL_NAME'] = x #compared to this
df= pd.read_excel("/Users/Vikas/Desktop/sample_data.xlsx", sheetname="Sheet1")
df.head(2)
df.at[0,'Name'] = "Vikas"
df.loc[0,'Age'] = 21
df.head(2)

    Name  Age Gender  Zipcode Married  Savings
0  Vikas   21      M     8820       N     5000
1   Row2   20      F    33511       N     2000

In [164]:
# Any other way to filter teh python data?
# yes using the query method
df= pd.read_excel("/Users/Vikas/Desktop/sample_data.xlsx", sheetname="Sheet1")
df['Name'].notnull() # display True or False based on the condition notnull
df['Name'].isnull() # display True or False based on the condition isnull

filtered_df = df.query("Age>50")
print(filtered_df) # why are we using print here, just to show that we can use print :-)

df.query("Zipcode > Savings") # Compare 2 columns from the same dataframe
df[df.Zipcode > df.Savings]  # same result as the above one

df.query("Zipcode > Savings and Married == 'N'") # multiple conditions

## More complex examples available here 
## http://pandas.pydata.org/pandas-docs/stable/indexing.html#the-query-method-experimental

    Name  Age Gender  Zipcode Married  Savings
5   Row6   60      F    23234       Y   100000
6   Row7   70      M    12432       Y   125000
7   Row8   80      F    88776       N    70000
8   Row9   90      F    78654       N    60000
9  Row10  100      M    55545       N    55000

    Name  Age Gender  Zipcode Married  Savings
0   Row1   10      M     8820       N     5000
1   Row2   20      F    33511       N     2000
7   Row8   80      F    88776       N    70000
8   Row9   90      F    78654       N    60000
9  Row10  100      M    55545       N    55000

In [22]:
# Drop all rows with missing information
# Syntax DataFrame.dropna(axis=0, how='any', thresh=None, subset=None, inplace=False)
# First Create a dataframe using dictonaries of list with some Missing Values
persons = {'Name': ['Person 1', 'Person 2', 'Person 3', np.NaN],
         'Country': ['USA', 'CHINA', 'INDIA', np.NaN],
         'Age': [10, 20, 30, np.NaN],
         'Gender': ['M', 'F', np.NaN, np.NaN],
         'Dummy_Column': [np.NaN, np.NaN, np.NaN, np.NaN] }
persons_df = pd.DataFrame(persons)
print(persons_df)

# Lets drop columns where all elements are nan
#persons_df.dropna(axis=1, how='all') # axis 1 signifies columns

# Lets drop all rows where all elements are nan
#persons_df.dropna(axis=0, how='all') # axis 0 signifies rows 

# Now drop columns where any of the elements is nan
# persons_df.dropna(axis=1, how='any') # Will delete everythign as each column has NaN 

# Next drop Rows where any of the elements is nan
#persons_df.dropna(axis=0, how='any') # Will delete everythign as each row has NaN 

# Retain rows with 3 or more non-na values
persons_df.dropna(axis =1, thresh=2)

    Age Country  Dummy_Column Gender      Name
0  10.0     USA           NaN      M  Person 1
1  20.0   CHINA           NaN      F  Person 2
2  30.0   INDIA           NaN    NaN  Person 3
3   NaN     NaN           NaN    NaN       NaN

    Age Country Gender      Name
0  10.0     USA      M  Person 1
1  20.0   CHINA      F  Person 2
2  30.0   INDIA    NaN  Person 3
3   NaN     NaN    NaN       NaN

In [ ]:
# Finally write back to a new Excel file
persons_df.to_excel("new_excel.xlsx", index=False)